nce2-4/L84.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-24 Sun 22:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org79bcfb5" class="outline-2">
<h2 id="org79bcfb5">Lesson 84 On strike</h2>
<div class="outline-text-2" id="text-org79bcfb5">
<p class="verse">
Who will be driving the buses next week?<br />
<br />
Busmen have decided to <b>go on strike</b> next week.<br />
The strike <b>is due to</b> begin on Tuesday.<br />
No one knows how long it will last.<br />
<b>The busmen have stated</b><br />
&#xa0;that the strike will continue<br />
&#xa0;&#xa0;until general <b>agreement is reached about</b> pay and working conditions.<br />
Most people believe<br />
&#xa0;that the strike will last for at least a week.<br />
Many owners of private cars are going to offer 'free rides' to people on their way to work.<br />
This will <b>relieve pressure</b> on the trains <b>to some extent</b>.<br />
Meanwhile, a number of university students have <b>volunteered to drive</b> buses<br />
&#xa0;while the strike lasts.<br />
All the students are expert drivers,<br />
&#xa0;but before they drive any of the buses,<br />
&#xa0;&#xa0;they will have to <b>pass a special test</b>.<br />
The students are going to <b>take the test</b> in two days' time.<br />
Even so, people are going to find it difficult to get to work.<br />
But so far, the public has <b>expressed its gratitude to</b> the students in letters to the Press.<br />
<b>Only one or two people have objected</b><br />
&#xa0;that the students will drive too fast!<br />
</p>
</div>

<div id="outline-container-org88688b1" class="outline-3">
<h3 id="org88688b1">words</h3>
<div class="outline-text-3" id="text-org88688b1">
<p>
strike [straɪk] n.罢工<br />
busman ['bʌsmən] n.公交车司机<br />
state [steɪt]	v.正式提出,宣布<br />
agreement [əˈɡrimənt] n.协议<br />
relieve [rɪˈliv] v.减轻<br />
pressure [ˈpreʃər] n.压力,麻烦<br />
extent [ɪkˈstent] n.程度<br />
volunteer [ˌvɑlənˈtɪr] v.自动提出,自愿<br />
gratitude [ˈɡrætɪˌtud] n.感激<br />
Press [pres] n.新闻界<br />
object [ɑbˈdʒekt] v.不赞成,反对<br />
</p>
</div>
</div>

<div id="outline-container-orgd7c8d41" class="outline-3">
<h3 id="orgd7c8d41"><span class="done DONE">DONE</span> 单词造句</h3>
<div class="outline-text-3" id="text-orgd7c8d41">
<p>
strike n. go on strike<br />
</p>
<ol class="org-ol">
<li>Workers are not allowed to go on strike in this country.<br /></li>
<li>The drivers in the city love to go on strike.<br /></li>
<li>On the following day, all the workers in the city went on strike.<br /></li>
<li>The firemen on duty are going on strike for some reasons.<br /></li>
<li>It is known that the teachers in the district have gone on strike for a month.<br /></li>
</ol>
<p>
busman n. bus driver<br />
</p>
<ol class="org-ol">
<li>Though a little suspicious, the bus driver gave the passenger the ticket.<br /></li>
<li>The bus driver was found to be a gangster.<br /></li>
<li>The bus driver has at times lost his temper while driving bus.<br /></li>
<li>The bus driver discovered that the passenger was Prime Minister.<br /></li>
<li>The bus driver knocked the policeman to the groud by a sharp blow.<br /></li>
</ol>
<p>
state v. sb. have stated that + &#x2026;<br />
</p>
<ol class="org-ol">
<li>The girl stated that she recognized the voice of her father's car enginee.<br /></li>
<li>My bossed has stated that we will have a better salary as soon as we pass the exam.<br /></li>
<li>My leader has stated that the program is full of mistakes.<br /></li>
<li>He stated that his boss refused to put forward the plan.<br /></li>
<li>He stated that he had planted a bom at the airport.<br /></li>
</ol>
<p>
agreement n. agreement is reached about sth.  reach an agreement<br />
</p>
<ol class="org-ol">
<li>The general agreement is reached about doing housework by my wife and me.<br /></li>
<li>We are used to failing to reach an agreement.<br /></li>
<li>We used to reach an agreement.<br /></li>
<li>We needn't have reached an agreement.<br /></li>
<li>He was curious to find out that his wife and his daughter reached a series of agreements.<br /></li>
</ol>
<p>
relieve v. sb. be relieved to hear that + &#x2026;  relieve pressure<br />
</p>
<ol class="org-ol">
<li>I was relieved to hear that Mr. Leo made a profit last year.<br /></li>
<li>I was relieved to hear that my son had gone to college.<br /></li>
<li>I was relieved to hear that the luxury was on display in the exhibition.<br /></li>
<li>I was relieved to hear that the lady and her baby had been rescued in the mountains.<br /></li>
<li>I was relieved to hear that the flight attandant will take charge of my baby.<br /></li>
</ol>
<p>
pressure n. under a lot of pressure  relieve pressure<br />
</p>
<ol class="org-ol">
<li>The kid is under a lot of pressure, for they are instructed to study day and night.<br /></li>
<li>He was under so much pressure that I felt frightened.<br /></li>
<li>Don't be hard on us, we are under a lot of pressure.<br /></li>
<li>He is always under a lot of pressure on board.<br /></li>
<li>His parents make every effort to relive his pressure, even allow him to smoke.<br /></li>
</ol>
<p>
extend  n. to some extend<br />
</p>
<ol class="org-ol">
<li>To some extend, you're responsible for her failure.<br /></li>
<li>To some extend, that's a splendid idea.<br /></li>
<li>To some extend, I was disappointed to learn that I failed the test.<br /></li>
<li>To some extend, I have followed in my father's footsteps.<br /></li>
<li>To some extend, she has difficulty in swimming in public places.<br /></li>
</ol>
<p>
volunteer v.n. volunteer to do sth.<br />
</p>
<ol class="org-ol">
<li>I need a volunteer to save the soldier's life.<br /></li>
<li>She used to volunteer to keep order in her twenties.<br /></li>
<li>I volunteered to teach these volunteers English.<br /></li>
<li>I intend to volunteer to do the dishes.<br /></li>
<li>She shouldn't have volunteered to keep order.<br /></li>
</ol>
<p>
gratitude n. expressed sb.'s gratitude to sb.<br />
</p>
<ol class="org-ol">
<li>I would like to express my gratitude to my relatives who ever help me.<br /></li>
<li>You should express your gratitude to anyone who help you.<br /></li>
<li>The moment she help me, I will express my gratitude to her.<br /></li>
<li>The kid was ordered to express her gratitude to Mr. Leo.<br /></li>
<li>We should have expressed our gratitude to Mr. Leo.<br /></li>
</ol>
<p>
press n.v.<br />
</p>
<ol class="org-ol">
<li>He is sending the news to the press.<br /></li>
<li>If you don't press the button, the radio won't start.<br /></li>
<li>Leo was defeated in the recent elections and I read about it in the press.<br /></li>
<li>The poor guy read about his wife's cheating in the press.<br /></li>
<li>He discovered that his firm had ran into serious trouble in the press.<br /></li>
</ol>
<p>
object v. objection n. sb. have objected that + &#x2026;  object to sth./sb.<br />
</p>
<ol class="org-ol">
<li>He objected that student study at night.<br /></li>
<li>I objected that he is expert at driving buses.<br /></li>
<li>She objected to Prime Minister and rushed up to him.<br /></li>
<li>We need objecting to prepared dishes.<br /></li>
<li>He insisted on objecting to prepared dishes.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org1868250" class="outline-3">
<h3 id="org1868250">反复听电影片段</h3>
</div>
<div id="outline-container-org77eb80a" class="outline-3">
<h3 id="org77eb80a">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-orga20a921" class="outline-3">
<h3 id="orga20a921">给自己讲解</h3>
</div>
<div id="outline-container-org5bb00a7" class="outline-3">
<h3 id="org5bb00a7">红皮书</h3>
</div>
<div id="outline-container-org6c86c9a" class="outline-3">
<h3 id="org6c86c9a"><span class="done DONE">DONE</span> 习惯用法造句</h3>
<div class="outline-text-3" id="text-org6c86c9a">
<p>
be due to do sth.<br />
</p>
<ol class="org-ol">
<li>They are due to catch a flight on the following day.<br /></li>
<li>They are due to have a long walk at the other side of West Lake.<br /></li>
<li>They are due to watch a musical in two hours.<br /></li>
<li>They are due to settle down in hometown.<br /></li>
<li>We are due to stick to the plan.<br /></li>
</ol>
<p>
pass/take the test<br />
</p>
<ol class="org-ol">
<li>I should have taken the test.<br /></li>
<li>I regretted taking the test.<br /></li>
<li>I was relieved to hear that I passed the test.<br /></li>
<li>He insisted on taking the test over and over again, even though he has already passed the test.<br /></li>
<li>Students always inquire about how to pass the test.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org62a10ac" class="outline-3">
<h3 id="org62a10ac">跟读至背诵</h3>
</div>
<div id="outline-container-orge6cac95" class="outline-3">
<h3 id="orge6cac95">Ask me if 写+读</h3>
</div>
<div id="outline-container-orgdd7b79b" class="outline-3">
<h3 id="orgdd7b79b">摘要写作</h3>
</div>
<div id="outline-container-org142f873" class="outline-3">
<h3 id="org142f873">tell the story 口语</h3>
</div>
<div id="outline-container-org5894306" class="outline-3">
<h3 id="org5894306">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
